In [1]:
import pandas as pd
import numpy as np
dictData = {
    'CA':10,
    'MX':1,
    'TX':20,
    'NY':29,
    'LA':20
}

obj3 = pd.Series(dictData)

obj3
states = ['CALI','NY','LA','TX','MX']

obj4 = pd.Series(dictData,index = states)

obj4

CALI     NaN
NY      29.0
LA      20.0
TX      20.0
MX       1.0
dtype: float64

In [4]:
obj4.isnull()
obj4.notnull()

# series name, index name, index
obj4.name = 'population'
obj4.index.name = 'city'
obj4.index = ['bob','carla','zoe','merci','alice']

data.rename(index = str.title,columns = str.upper)

data.rename(index = {'OHIO':'Texas'},
           columns = {'three':"renamed index"},
           inplace=True)

CALI     NaN
NY      29.0
LA      20.0
TX      20.0
MX       1.0
Name: population, dtype: float64

# hierarchical indexing

 to use more than 1 index in hierarchical way

In [54]:
df = pd.Series(np.random.randn(8),
                 index = [['DS','DS','CS','CS','ACT','ACT','MBA','MBA'],
                          [1,2,1,2,1,2,1,2]])

In [55]:
df

DS   1    0.879147
     2   -1.126667
CS   1    0.075254
     2   -0.462983
ACT  1   -0.076911
     2   -1.861178
MBA  1   -0.092321
     2    1.572936
dtype: float64

In [56]:
df.index

MultiIndex([( 'DS', 1),
            ( 'DS', 2),
            ( 'CS', 1),
            ( 'CS', 2),
            ('ACT', 1),
            ('ACT', 2),
            ('MBA', 1),
            ('MBA', 2)],
           )

In [52]:
df['CS']

1    1.829068
2   -0.309533
dtype: float64

In [58]:
data = pd.Series(np.random.randn(9),index = [['a','a','a','b','b','b','c','c','c'],[1,2,3,4,5,6,7,8,9]])

In [59]:
data['b':'c']

b  4    0.239136
   5    0.344298
   6   -2.500275
c  7   -0.658239
   8    0.437104
   9    0.514508
dtype: float64

In [60]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 4),
            ('b', 5),
            ('b', 6),
            ('c', 7),
            ('c', 8),
            ('c', 9)],
           )

In [64]:
df

DS   1    0.879147
     2   -1.126667
CS   1    0.075254
     2   -0.462983
ACT  1   -0.076911
     2   -1.861178
MBA  1   -0.092321
     2    1.572936
dtype: float64

In [63]:
df.unstack()

            1         2
ACT -0.076911 -1.861178
CS   0.075254 -0.462983
DS   0.879147 -1.126667
MBA -0.092321  1.572936

In [2]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})

In [3]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [4]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})

In [5]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [6]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [7]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [8]:
import pandas as pd
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [9]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

In [10]:
pd.merge(df1,df2)

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [14]:
pd.merge(df1,df2,on = 'city')
# on common column

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [16]:
import pandas as pd
df3 = pd.DataFrame({
    "city": ["new york","chicago","orlando",'Las vegas'],
    "temperature": [21,14,35,39],
})
df3

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  Las vegas           39

In [18]:
df4 = pd.DataFrame({
    "city": ["chicago","new york","Alaska"],
    "humidity": [65,68,75]})
df4

       city  humidity
0   chicago        65
1  new york        68
2    Alaska        75

In [19]:
pd.merge(df3,df4)

# default - inner join

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [28]:
pd.merge(df3,df4,how='outer',indicator = True)

        city  temperature  humidity      _merge
0   new york         21.0      68.0        both
1    chicago         14.0      65.0        both
2    orlando         35.0       NaN   left_only
3  Las vegas         39.0       NaN   left_only
4     Alaska          NaN      75.0  right_only

In [26]:
pd.merge(df3,df4,how='right')

       city  temperature  humidity
0   chicago         14.0        65
1  new york         21.0        68
2    Alaska          NaN        75

In [27]:
pd.merge(df3,df4,how='left')

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35       NaN
3  Las vegas           39       NaN

# suffixes

In [29]:
df5 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35,38],
    "humidity": [65,68,71, 75]
})
df5

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           38        75

In [30]:
df6 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "temperature": [21,14,35],
    "humidity": [65,68,71]
})
df6

        city  temperature  humidity
0    chicago           21        65
1   new york           14        68
2  san diego           35        71

In [32]:
pd.merge(df5,df6,on='city')

       city  temperature_x  humidity_x  temperature_y  humidity_y
0  new york             21          65             14          68
1   chicago             14          68             21          65

In [33]:
pd.merge(df5,df6,on='city',suffixes = ("_left","_right"))

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,new york,21,65,14,68
1,chicago,14,68,21,65

In [34]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
'data1': range(6)})
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
'data2': range(5)})
df1
df2
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

# concate

In [36]:
import pandas as pd

ind = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
ind

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [37]:
us = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [41]:
pd.concat([ind,us])

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [42]:
pd.concat([ind,us],ignore_index=True)

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [43]:
pd.concat([ind,us],keys = ['India','USA'])

             city  temperature  humidity
India 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
USA   0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [44]:
temp = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[0,1,2])
temp

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [45]:
wind = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
}, index=[1,0])
wind

     city  windspeed
1   delhi          7
0  mumbai         12

In [48]:
pd.concat([temp,wind])

       city  temperature  windspeed
0    mumbai         32.0        NaN
1     delhi         45.0        NaN
2  banglore         30.0        NaN
1     delhi          NaN        7.0
0    mumbai          NaN       12.0

In [47]:
pd.concat([temp,wind],axis=1)

       city  temperature    city  windspeed
0    mumbai           32  mumbai       12.0
1     delhi           45   delhi        7.0
2  banglore           30     NaN        NaN